{"class_name": "Model", "keras_version": "1.1.1", "config": {"name": "model_1", "output_layers": [["float_m1p1", 0, 0]], "layers": [{"name": "input_z", "class_name": "InputLayer", "config": {"name": "input_z", "batch_input_shape": [null, 1, 1, 100], "sparse": false, "input_dtype": "float32"}, "inbound_nodes": []}, {"name": "input_tag", "class_name": "InputLayer", "config": {"name": "input_tag", "batch_input_shape": [null, 1, 1, 64], "sparse": false, "input_dtype": "float32"}, "inbound_nodes": []}, {"name": "merge_1", "class_name": "Merge", "config": {"name": "merge_1", "output_shape_type": "raw", "output_shape": null, "mode": "concat", "concat_axis": 3, "dot_axes": -1, "mode_type": "raw"}, "inbound_nodes": [[["input_z", 0, 0], ["input_tag", 0, 0]]]}, {"name": "dc0", "class_name": "Deconvolution2D", "config": {"nb_row": 6, "dim_ordering": "tf", "border_mode": "valid", "name": "dc0", "bias": true, "nb_filter": 1024, "init": "glorot_uniform", "activation": "linear", "b_regularizer": null, "W_regularizer": null, "trainable": true, "subsample": [1, 1], "output_shape": [null, 6, 6, 1024], "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "nb_col": 6}, "inbound_nodes": [[["merge_1", 0, 0]]]}, {"name": "bn0", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "bn0", "epsilon": 2e-05, "trainable": true, "mode": 0, "momentum": 0.9, "axis": 3, "gamma_regularizer": null}, "inbound_nodes": [[["dc0", 0, 0]]]}, {"name": "bottle1_conv1", "class_name": "Convolution2D", "config": {"nb_row": 1, "b_constraint": null, "W_regularizer": null, "bias": true, "nb_filter": 256, "init": "glorot_uniform", "activation": "linear", "b_regularizer": null, "name": "bottle1_conv1", "trainable": true, "subsample": [1, 1], "border_mode": "valid", "activity_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "nb_col": 1}, "inbound_nodes": [[["bn0", 0, 0]]]}, {"name": "bottle1_bn1", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "bottle1_bn1", "epsilon": 2e-05, "trainable": true, "mode": 0, "momentum": 0.9, "axis": 3, "gamma_regularizer": null}, "inbound_nodes": [[["bottle1_conv1", 0, 0]]]}, {"name": "activation_1", "class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}, "inbound_nodes": [[["bottle1_bn1", 0, 0]]]}, {"name": "zeropadding2d_1", "class_name": "ZeroPadding2D", "config": {"name": "zeropadding2d_1", "padding": [1, 1], "trainable": true}, "inbound_nodes": [[["activation_1", 0, 0]]]}, {"name": "bottle1_conv2", "class_name": "Convolution2D", "config": {"nb_row": 3, "b_constraint": null, "W_regularizer": null, "bias": true, "nb_filter": 256, "init": "glorot_uniform", "activation": "linear", "b_regularizer": null, "name": "bottle1_conv2", "trainable": true, "subsample": [1, 1], "border_mode": "valid", "activity_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "nb_col": 3}, "inbound_nodes": [[["zeropadding2d_1", 0, 0]]]}, {"name": "bottle1_bn2", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "bottle1_bn2", "epsilon": 2e-05, "trainable": true, "mode": 0, "momentum": 0.9, "axis": 3, "gamma_regularizer": null}, "inbound_nodes": [[["bottle1_conv2", 0, 0]]]}, {"name": "activation_2", "class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}, "inbound_nodes": [[["bottle1_bn2", 0, 0]]]}, {"name": "bottle1_conv3", "class_name": "Convolution2D", "config": {"nb_row": 1, "b_constraint": null, "W_regularizer": null, "bias": true, "nb_filter": 1024, "init": "glorot_uniform", "activation": "linear", "b_regularizer": null, "name": "bottle1_conv3", "trainable": true, "subsample": [1, 1], "border_mode": "valid", "activity_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "nb_col": 1}, "inbound_nodes": [[["activation_2", 0, 0]]]}, {"name": "bottle1_bn3", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "bottle1_bn3", "epsilon": 2e-05, "trainable": true, "mode": 0, "momentum": 0.9, "axis": 3, "gamma_regularizer": null}, "inbound_nodes": [[["bottle1_conv3", 0, 0]]]}, {"name": "merge_2", "class_name": "Merge", "config": {"name": "merge_2", "output_shape_type": "raw", "output_shape": null, "mode": "sum", "concat_axis": -1, "dot_axes": -1, "mode_type": "raw"}, "inbound_nodes": [[["bottle1_bn3", 0, 0], ["bn0", 0, 0]]]}, {"name": "activation_3", "class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}, "inbound_nodes": [[["merge_2", 0, 0]]]}, {"name": "dc1", "class_name": "Deconvolution2D", "config": {"nb_row": 4, "dim_ordering": "tf", "border_mode": "same", "name": "dc1", "bias": true, "nb_filter": 512, "init": "glorot_uniform", "activation": "linear", "b_regularizer": null, "W_regularizer": null, "trainable": true, "subsample": [2, 2], "output_shape": [null, 12, 12, 512], "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "nb_col": 4}, "inbound_nodes": [[["activation_3", 0, 0]]]}, {"name": "bn1", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "bn1", "epsilon": 2e-05, "trainable": true, "mode": 0, "momentum": 0.9, "axis": 3, "gamma_regularizer": null}, "inbound_nodes": [[["dc1", 0, 0]]]}, {"name": "bottle2_conv1", "class_name": "Convolution2D", "config": {"nb_row": 1, "b_constraint": null, "W_regularizer": null, "bias": true, "nb_filter": 128, "init": "glorot_uniform", "activation": "linear", "b_regularizer": null, "name": "bottle2_conv1", "trainable": true, "subsample": [1, 1], "border_mode": "valid", "activity_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "nb_col": 1}, "inbound_nodes": [[["bn1", 0, 0]]]}, {"name": "bottle2_bn1", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "bottle2_bn1", "epsilon": 2e-05, "trainable": true, "mode": 0, "momentum": 0.9, "axis": 3, "gamma_regularizer": null}, "inbound_nodes": [[["bottle2_conv1", 0, 0]]]}, {"name": "activation_4", "class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}, "inbound_nodes": [[["bottle2_bn1", 0, 0]]]}, {"name": "zeropadding2d_2", "class_name": "ZeroPadding2D", "config": {"name": "zeropadding2d_2", "padding": [1, 1], "trainable": true}, "inbound_nodes": [[["activation_4", 0, 0]]]}, {"name": "bottle2_conv2", "class_name": "Convolution2D", "config": {"nb_row": 3, "b_constraint": null, "W_regularizer": null, "bias": true, "nb_filter": 128, "init": "glorot_uniform", "activation": "linear", "b_regularizer": null, "name": "bottle2_conv2", "trainable": true, "subsample": [1, 1], "border_mode": "valid", "activity_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "nb_col": 3}, "inbound_nodes": [[["zeropadding2d_2", 0, 0]]]}, {"name": "bottle2_bn2", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "bottle2_bn2", "epsilon": 2e-05, "trainable": true, "mode": 0, "momentum": 0.9, "axis": 3, "gamma_regularizer": null}, "inbound_nodes": [[["bottle2_conv2", 0, 0]]]}, {"name": "activation_5", "class_name": "Activation", "config": {"name": "activation_5", "activation": "relu", "trainable": true}, "inbound_nodes": [[["bottle2_bn2", 0, 0]]]}, {"name": "bottle2_conv3", "class_name": "Convolution2D", "config": {"nb_row": 1, "b_constraint": null, "W_regularizer": null, "bias": true, "nb_filter": 512, "init": "glorot_uniform", "activation": "linear", "b_regularizer": null, "name": "bottle2_conv3", "trainable": true, "subsample": [1, 1], "border_mode": "valid", "activity_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "nb_col": 1}, "inbound_nodes": [[["activation_5", 0, 0]]]}, {"name": "bottle2_bn3", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "bottle2_bn3", "epsilon": 2e-05, "trainable": true, "mode": 0, "momentum": 0.9, "axis": 3, "gamma_regularizer": null}, "inbound_nodes": [[["bottle2_conv3", 0, 0]]]}, {"name": "merge_3", "class_name": "Merge", "config": {"name": "merge_3", "output_shape_type": "raw", "output_shape": null, "mode": "sum", "concat_axis": -1, "dot_axes": -1, "mode_type": "raw"}, "inbound_nodes": [[["bottle2_bn3", 0, 0], ["bn1", 0, 0]]]}, {"name": "activation_6", "class_name": "Activation", "config": {"name": "activation_6", "activation": "relu", "trainable": true}, "inbound_nodes": [[["merge_3", 0, 0]]]}, {"name": "dc2", "class_name": "Deconvolution2D", "config": {"nb_row": 4, "dim_ordering": "tf", "border_mode": "same", "name": "dc2", "bias": true, "nb_filter": 256, "init": "glorot_uniform", "activation": "linear", "b_regularizer": null, "W_regularizer": null, "trainable": true, "subsample": [2, 2], "output_shape": [null, 24, 24, 256], "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "nb_col": 4}, "inbound_nodes": [[["activation_6", 0, 0]]]}, {"name": "bn2", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "bn2", "epsilon": 2e-05, "trainable": true, "mode": 0, "momentum": 0.9, "axis": 3, "gamma_regularizer": null}, "inbound_nodes": [[["dc2", 0, 0]]]}, {"name": "activation_7", "class_name": "Activation", "config": {"name": "activation_7", "activation": "relu", "trainable": true}, "inbound_nodes": [[["bn2", 0, 0]]]}, {"name": "dc3", "class_name": "Deconvolution2D", "config": {"nb_row": 4, "dim_ordering": "tf", "border_mode": "same", "name": "dc3", "bias": true, "nb_filter": 128, "init": "glorot_uniform", "activation": "linear", "b_regularizer": null, "W_regularizer": null, "trainable": true, "subsample": [2, 2], "output_shape": [null, 48, 48, 128], "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "nb_col": 4}, "inbound_nodes": [[["activation_7", 0, 0]]]}, {"name": "bn3", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "bn3", "epsilon": 2e-05, "trainable": true, "mode": 0, "momentum": 0.9, "axis": 3, "gamma_regularizer": null}, "inbound_nodes": [[["dc3", 0, 0]]]}, {"name": "activation_8", "class_name": "Activation", "config": {"name": "activation_8", "activation": "relu", "trainable": true}, "inbound_nodes": [[["bn3", 0, 0]]]}, {"name": "dc_last", "class_name": "Deconvolution2D", "config": {"nb_row": 4, "dim_ordering": "tf", "border_mode": "same", "name": "dc_last", "bias": true, "nb_filter": 3, "init": "glorot_uniform", "activation": "linear", "b_regularizer": null, "W_regularizer": null, "trainable": true, "subsample": [2, 2], "output_shape": [null, 96, 96, 3], "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "nb_col": 4}, "inbound_nodes": [[["activation_8", 0, 0]]]}, {"name": "float_m1p1", "class_name": "Activation", "config": {"name": "float_m1p1", "activation": "tanh", "trainable": true}, "inbound_nodes": [[["dc_last", 0, 0]]]}], "input_layers": [["input_z", 0, 0], ["input_tag", 0, 0]]}}